# LastCopyOfGroupDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..LastCopyOfGroupDeleted Property
BuiltInFailures..::..GroupFailures Class See Also
---
Last copy of Group "[Name]" deleted. Group type removed from project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LastCopyOfGroupDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LastCopyOfGroupDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LastCopyOfGroupDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace